# GroupBy

In [1]:
import pandas as pd

In [2]:
#Create dataFrame
data1={'Location':['PUNE','MYS','HYDB','MYS','PUNE','MYS'],
       'Person':['RAM','HARISH','ANAND','SUDHA','SUMEGHA','MELVIN'],
       'Sales':[1200,1140,1340,1124,2143,1350]}

In [3]:
df1=pd.DataFrame(data1)
df1

  Location   Person  Sales
0     PUNE      RAM   1200
1      MYS   HARISH   1140
2     HYDB    ANAND   1340
3      MYS    SUDHA   1124
4     PUNE  SUMEGHA   2143
5      MYS   MELVIN   1350

In [4]:
df1.shape#it give number of rows & columns

(6, 3)

In [5]:
df1.columns#give the columns name

Index(['Location', 'Person', 'Sales'], dtype='object')

In [6]:
df1.info()#it give all information about data frame
# non-null=give the actual value in column
#dtype=give the column data type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Location  6 non-null      object
 1   Person    6 non-null      object
 2   Sales     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [7]:
#Grouping based on location
df1.groupby('Location')

In [8]:
by_location=pd.DataFrame(df1.groupby("Location"),columns=["Location","Information"])
by_location

  Location                                        Information
0     HYDB    Location Person  Sales
2     HYDB  ANAND   1340
1      MYS    Location  Person  Sales
1      MYS  HARISH  ...
2     PUNE    Location   Person  Sales
0     PUNE      RAM...

In [9]:
by_location2=pd.DataFrame(df1.groupby(["Location","Person"]),columns=["Location","Information"])
by_location2

          Location                                        Information
0    (HYDB, ANAND)    Location Person  Sales
2     HYDB  ANAND   1340
1    (MYS, HARISH)    Location  Person  Sales
1      MYS  HARISH  ...
2    (MYS, MELVIN)    Location  Person  Sales
5      MYS  MELVIN  ...
3     (MYS, SUDHA)    Location Person  Sales
3      MYS  SUDHA   1124
4      (PUNE, RAM)    Location Person  Sales
0     PUNE    RAM   1200
5  (PUNE, SUMEGHA)    Location   Person  Sales
4     PUNE  SUMEGHA...

In [10]:
df2=df1.drop(columns="Person")
df2

  Location  Sales
0     PUNE   1200
1      MYS   1140
2     HYDB   1340
3      MYS   1124
4     PUNE   2143
5      MYS   1350

In [11]:
by_location3=df2.groupby("Location")
by_location3

In [12]:
by_location3=pd.DataFrame(df2.groupby("Location"),columns=["Location","Information"])
by_location3

  Location                                        Information
0     HYDB                  Location  Sales
2     HYDB   1340
1      MYS    Location  Sales
1      MYS   1140
3      MYS...
2     PUNE    Location  Sales
0     PUNE   1200
4     PUNE...

In [21]:
y=by_location3.mean()
y

C:\Users\SHUBHAM\AppData\Local\Temp\ipykernel_13364\662325393.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  y=by_location3.mean()

Series([], dtype: float64)

In [14]:
df2

  Location  Sales
0     PUNE   1200
1      MYS   1140
2     HYDB   1340
3      MYS   1124
4     PUNE   2143
5      MYS   1350

In [15]:
#All together
x=df2.groupby("Location").mean()
x

                Sales
Location
HYDB      1340.000000
MYS       1204.666667
PUNE      1671.500000

In [16]:
x.value_counts()

Sales
1204.666667    1
1340.000000    1
1671.500000    1
dtype: int64

In [17]:
by_location3.std()

C:\Users\SHUBHAM\AppData\Local\Temp\ipykernel_13364\1412258483.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  by_location3.std()

Series([], dtype: float64)

In [18]:
df2.groupby("Location").min()

          Sales
Location
HYDB       1340
MYS        1124
PUNE       1200

In [19]:
df2.groupby("Location").max()

          Sales
Location
HYDB       1340
MYS        1350
PUNE       2143

In [20]:
by_location.count()

Location       3
Information    3
dtype: int64